In [ ]:
"""
Data cleaning means fixing bad data in your data set.

Bad data could be:
    - Empty cells - give you a wrong result when you analyze data.
        - remove row contain empty cells (dataset usually very large, so removing some rows will not a big deal)
        - Replace Empty Values - not have to delete entire rows just because of some empty cells
        - Replace Using Mean, Median, or Mode (the value that appears most frequently.)
    - Data in wrong format
        - remove the rows
        - convert to the same format
    - Wrong data
        - Replacing Values
    - Duplicates
"""

In [ ]:
"""
Other type:
    - Unnecesary
"""

In [2]:
import pandas as pd
import numpy as np

In [6]:
"""
- "Bad data" depend on the scenario and context of dataset
- falsy_values = (0, False, None, '', [], {})
"""
if "":
    print(True)
else:
    print(False)

False

In [ ]:
# - np.nan == None
np.nan
np.nan + 3
a = np.array([1, 2, 3, np.nan, np.nan, 4])
a
a.sum()
a.mean()

In [7]:
# None + 3
a = np.array([1, 2, 3, np.nan, None, 4])
a = np.array([1, 2, 3, np.nan, None, 4], dtype="float")
a

array([ 1.,  2.,  3., nan, nan,  4.])

In [8]:
np.inf
3 + np.inf
np.inf / np.inf
b = np.array([1, 2, 3, np.inf, np.nan, 4], dtype="float")
b
b.sum()

inf

In [ ]:
# checking for nan and inf
np.isnan(np.nan)
np.isinf(np.inf)
np.isnan(np.array([1, 2, 3, np.nan, np.inf, 4]))

In [10]:
a[~np.isnan(a)]
a[np.isfinite(a)].sum()

10.0

In [12]:
pd.isnull(np.nan)
pd.isna(np.nan)

# opposite
pd.notnull(None)
pd.notna(np.nan)
pd.notna(0)

True

In [ ]:
# work with series or dataframe
pd.isnull(pd.Series([1, np.nan, 7]))
pd.notnull(pd.Series([1, np.nan, 7]))

In [ ]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
}))

In [ ]:
pd.Series([1, 2, np.nan]).count()
pd.Series([1, 2, np.nan]).sum()
pd.Series([2, 2, np.nan]).mean()

In [14]:
# filtering missing data
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [ ]:
pd.notnull(s)
pd.isnull(s)
# sum does not return sum of value, it's return the number of value
pd.notnull(s).sum()
pd.isnull(s).sum()

In [16]:
s.isnull() # ==> series and dataframe have isnull()
s[pd.notnull(s)]
s[pd.notnull(s)]

10.0

In [ ]:
# drop nan item
s.dropna()

In [18]:
# with DataFrame, there will be a few more things to consider, because you can't drop single values. You can only drop entire columns or rows
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 34, 110],
})

In [19]:
df
df.shape
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [20]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [21]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [ ]:
# The default dropna behavior will drop all the rows in which any null value is present:
df.dropna()
df.dropna(axis=1)
df.dropna(axis='columns')

In [24]:
df.dropna(how='any')  # default behavior
df.dropna(how='all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [32]:
# thresh parameter to indicate a threshold (a minimum number) of non-null values for the row/column to be kept
df.dropna(thresh=3)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [ ]:
# fill nan
s.fillna(0)
s.fillna(s.mean())

In [1]:
s.fillna(method='ffill')
s.fillna(method='bfill')

NameError: name 's' is not defined

In [ ]:
# not recommend, cuz it's can make a mess
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

In [ ]:
# fill dataframe
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})
df.fillna(method='ffill', axis=0)
df.fillna(method='ffill', axis='rows')

In [ ]:
# Checking if there are NAs
# The question is: Does this `Series` or `DataFrame` contain any missing value? The answer should be yes or no: `True` or `False`. How can you verify it?

In [ ]:
# **Example 1: Checking the length**

# If there are missing values, `s.dropna()` will have less elements than `s`:

s.dropna().count()
missing_values = len(s.dropna()) != len(s)
missing_values = s.count() != len(s)
missing_values

In [ ]:
len(s)
s.count()

In [ ]:
# The methods `any` and `all` check if either there's `any` True value in a Series or `all` the values are `True`. They work in the same way as in Python:

In [ ]:
pd.Series([1, np.nan]).isnull().any()
pd.Series([1, 2]).isnull().any()
s.isnull().any()

In [ ]:
# end of empty cell

In [8]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25],
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [ ]:
# finding unique values: notice them, identify them and handle them (remove, replace, etc)

In [25]:
df['Sex'].unique()
np.size(df['Sex'].unique())
df['Sex'].value_counts()

F    2
M    1
D    1
?    1
Name: Sex, dtype: int64

In [ ]:
df['Sex'].replace('D', 'F')
df['Sex'].replace({'D': 'F', 'N': 'M'})
df.replace({
    'Sex': {
        'D': 'F',
        'N': 'M'
    },
    'Age': {
        290: 29
    }
})

In [27]:
df[df['Age'] > 100]
# df.loc[df["Age"] > 100, "Age"]
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

3    290
Name: Age, dtype: int64

In [29]:
# handling duplicated data
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])
ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [30]:
ambassadors.duplicated()
ambassadors.duplicated(keep='last')
ambassadors.duplicated(keep=False)

Gérard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [ ]:
ambassadors.drop_duplicates()
ambassadors.drop_duplicates(keep='last')
ambassadors.drop_duplicates(keep=False)

In [31]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [ ]:
players.duplicated()
players.duplicated(subset=['Name'])
players.duplicated(subset=['Name'], keep='last')

In [ ]:
players.drop_duplicates()
players.drop_duplicates(subset=['Name'])
players.drop_duplicates(subset=['Name'], keep='last')

In [33]:
# text handling
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   VN_1',
        '1985_F_V   N_2'
]})
df
# "year, Sex, Country and number of children"

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [38]:
df['Data'].str.split('_')
df['Data'].str.split('_', expand=True)
df = df['Data'].str.split('_', expand=True)
df

    Year Sex Country No Children
0   1987   M     US            1
1  1990?   M      UK           1
2   1992   F      US           2
3  1970?   M      IT           1
4   1985   F    I  T           2

In [ ]:
df.columns = ['Year', 'Sex', 'Country', 'No Children']
df

In [40]:
df['Year'].str.contains('\?')
df['Country'].str.contains('U')

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

In [ ]:
df['Country'].str.strip()
df['Country'].str.lstrip()
df['Country'].str.rstrip()
df['Country'].str.replace(' ', '')

In [22]:
df = pd.read_csv("resource\simple_student_detail_wrong.csv")
df

,id,full_name,sex,math,physics,biology,chemistry,english,art,music,overall,Note
0,Nestech_001,Nguyen Phu Trong,M,8.0,4.0,4.0,7.0,6.0,4.0,4.0,5.285714,Lop Truong
1,Nestech_002,Vo Van Thuong,M,3.0,NaN,8.0,NaN,5.0,4.0,6.0,3.714286,Pho Lop Truong
2,Nestech_003,Nguyen Hoang Kieu Trinh,F,6.0,2.0,65.0,8.0,3.0,NaN,1.0,12.142857,NaN
3,Nestech_004,Viktor Nguyen,M,NaN,8.0,9.0,NaN,7.0,7.0,6.0,5.285714,NaN
4,Nestech_005,Clint Nguyen,M,8.0,9.0,7.0,3.0,2.0,8.0,8.0,6.428571,NaN
5,Nestech_006,Nguyen Van Toan,M,9.0,5.0,NaN,5.0,7.0,2.0,NaN,4.000000,NaN
6,Nestech_007,Kha Kim Bao Han,F,10.0,79.0,5.0,9.0,8.0,4.0,5.0,17.142857,Ex
7,Nestech_008,Pham Le Tram Anh,F,5.0,5.0,1.0,5.0,44.0,6.0,8.0,10.571429,Ex
8,Nestech_009,Ba Hoang Kim Thinh,F,4.0,7.0,NaN,7.0,NaN,6.0,2.0,3.714286,Ex
9,Nestech_010,Giap Phi Hoang,M,6.0,6.0,8.0,2.0,8.0,7.0,45.0,11.714286,Y Thuc Kem

In [11]:
# df.shape
# df.info()
# df.describe()
# df[["math", "physics", "biology", "chemistry", "english", "art", "music"]].astype("int64")
df[["math", "physics", "biology", "chemistry", "english", "art", "music"]]

   math  physics  biology  chemistry  english  art  music
0   8.0      4.0      4.0        7.0      6.0  4.0    4.0
1   3.0      NaN      8.0        NaN      5.0  4.0    6.0
2   6.0      2.0     65.0        8.0      3.0  NaN    1.0
3   NaN      8.0      9.0        NaN      7.0  7.0    6.0
4   8.0      9.0      7.0        3.0      2.0  8.0    8.0
5   9.0      5.0      NaN        5.0      7.0  2.0    NaN
6  10.0     79.0      5.0        9.0      8.0  4.0    5.0
7   5.0      5.0      1.0        5.0     44.0  6.0    8.0
8   4.0      7.0      NaN        7.0      NaN  6.0    2.0
9   6.0      6.0      8.0        2.0      8.0  7.0   45.0

In [17]:
# remove_na_df = df.dropna() # remove row
# remove_na_df = df.fillna(5) # replace empty value
remove_na_df = df[["math", "physics"]].fillna(5) # replace empty value
remove_na_df

   math  physics
0   8.0      4.0
1   3.0      5.0
2   6.0      2.0
3   5.0      8.0
4   8.0      9.0
5   9.0      5.0
6  10.0     79.0
7   5.0      5.0
8   4.0      7.0
9   6.0      6.0

In [23]:
# df["math"] = df["math"].astype(str)
# df["math"] = pd.to_datetime()
# df.dropna(subset=["math"])
df

,id,full_name,sex,math,physics,biology,chemistry,english,art,music,overall,Note
0,Nestech_001,Nguyen Phu Trong,M,8.0,4.0,4.0,7.0,6.0,4.0,4.0,5.285714,Lop Truong
1,Nestech_002,Vo Van Thuong,M,3.0,NaN,8.0,NaN,5.0,4.0,6.0,3.714286,Pho Lop Truong
2,Nestech_003,Nguyen Hoang Kieu Trinh,F,6.0,2.0,65.0,8.0,3.0,NaN,1.0,12.142857,NaN
3,Nestech_004,Viktor Nguyen,M,NaN,8.0,9.0,NaN,7.0,7.0,6.0,5.285714,NaN
4,Nestech_005,Clint Nguyen,M,8.0,9.0,7.0,3.0,2.0,8.0,8.0,6.428571,NaN
5,Nestech_006,Nguyen Van Toan,M,9.0,5.0,NaN,5.0,7.0,2.0,NaN,4.000000,NaN
6,Nestech_007,Kha Kim Bao Han,F,10.0,79.0,5.0,9.0,8.0,4.0,5.0,17.142857,Ex
7,Nestech_008,Pham Le Tram Anh,F,5.0,5.0,1.0,5.0,44.0,6.0,8.0,10.571429,Ex
8,Nestech_009,Ba Hoang Kim Thinh,F,4.0,7.0,NaN,7.0,NaN,6.0,2.0,3.714286,Ex
9,Nestech_010,Giap Phi Hoang,M,6.0,6.0,8.0,2.0,8.0,7.0,45.0,11.714286,Y Thuc Kem

In [24]:
df.loc[6, 'physics'] = 7.9
df

,id,full_name,sex,math,physics,biology,chemistry,english,art,music,overall,Note
0,Nestech_001,Nguyen Phu Trong,M,8.0,4.0,4.0,7.0,6.0,4.0,4.0,5.285714,Lop Truong
1,Nestech_002,Vo Van Thuong,M,3.0,NaN,8.0,NaN,5.0,4.0,6.0,3.714286,Pho Lop Truong
2,Nestech_003,Nguyen Hoang Kieu Trinh,F,6.0,2.0,65.0,8.0,3.0,NaN,1.0,12.142857,NaN
3,Nestech_004,Viktor Nguyen,M,NaN,8.0,9.0,NaN,7.0,7.0,6.0,5.285714,NaN
4,Nestech_005,Clint Nguyen,M,8.0,9.0,7.0,3.0,2.0,8.0,8.0,6.428571,NaN
5,Nestech_006,Nguyen Van Toan,M,9.0,5.0,NaN,5.0,7.0,2.0,NaN,4.000000,NaN
6,Nestech_007,Kha Kim Bao Han,F,10.0,7.9,5.0,9.0,8.0,4.0,5.0,17.142857,Ex
7,Nestech_008,Pham Le Tram Anh,F,5.0,5.0,1.0,5.0,44.0,6.0,8.0,10.571429,Ex
8,Nestech_009,Ba Hoang Kim Thinh,F,4.0,7.0,NaN,7.0,NaN,6.0,2.0,3.714286,Ex
9,Nestech_010,Giap Phi Hoang,M,6.0,6.0,8.0,2.0,8.0,7.0,45.0,11.714286,Y Thuc Kem

In [25]:
for x in df.index:
    if df.loc[x, "math"] > 10:
        df.loc[x, "math"] = 18

In [ ]:
for x in df.index:
    if df.loc[x, "math"] > 10:
        df.drop(x, inplace = True)

In [26]:
df.duplicated()
df.drop_duplicates()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool